<?php

    class ScheduleTasktype
    {
        protected static array $tasktype = [
            1 => 'Лекція',
            2 => 'Практика',
            3 => 'Лаб. роб.',
            4 => 'Консультація',
            5 => 'Залік',
            6 => 'Екзамен',
            7 => '---',
            8 => 'Наст. лек.',
            9 => 'Наст. пр.',
            10 => 'Наст. лаб.',
            11 => 'КП',
            12 => 'Факультатив',
            13 => 'Перескладання',
            14 => 'Захист кваліфікаційної роботи',
            15 => 'Консультація (сем)',
            16 => 'ККР',
            17 => 'Дистанційний модуль',
            18 => 'Онлайн лек.',
            19 => 'Онлайн практ.',
            20 => 'Онлайн лаб.',
            21 => 'Онлайн конс.',
            22 => 'Онлайн зал.',
            23 => 'Онлайн екз.',
            24 => 'Онлайн перескл.',
            25 => 'Онлайн ф-в.',
            26 => 'Онлайн модуль',
        ];

        public static function getTaskTypes() 
        {
            return self::$tasktype;
        }
    }